ITE311-ALCAYDE/app/Controllers/Auth.php

SELECT *
FROM `users`
WHERE `email` = 'keithyvheaiv@gmail.com'
---
    public function login() {
        helper(['form']);
        $message = [];

        if($this->request->is('post')) {
            $rules = [
                'email' => 'required|valid_email',
                'password' => 'required|min_length[8]|max_length[255]'
            ];

            if($this->validate($rules)) {
                $email = $this->request->getPost('email');
                $password = $this->request->getPost('password');

                $user =\Config\Database::connect()->table('users')
                       ->where('email', $email)->get()->getRow();