ITE311-ALCAYDE/app/Controllers/Home.php

SELECT *
FROM `users`
---
    public function userManagement() {
        helper(['form']); // Load form helper for form validation
        // Check if the user is an admin and logged in
        if (session()->get('user_role') !== 'admin' || !session()->get('isLoggedIn')) {
            session()->setFlashdata('error', 'Access denied. Admins only.'); // Set an error message for unauthorized access
            return redirect()->to(base_url('dashboard')); // Redirect to the dashboard
        }
        // Fetch all users from the database
        $users = \Config\Database::connect()->table('users')->get()->getResultArray();

SELECT *
FROM `users`
WHERE `name` LIKE '% %' ESCAPE '!'
OR  `email` LIKE '% %' ESCAPE '!'
---
    public function searchUser() {
        helper(['form']); // Load form helper for form validation
        // Check if the request method is POST
        if($this->request->is('post')) {
            $searchTerm = $this->request->getPost('search_term'); // Get the search term from the form

            // Query the database for users matching the search term
            $users = \Config\Database::connect()->table('users')
                     ->like('name', $searchTerm) // Search by name
                     ->orLike('email', $searchTerm) // Or search by email
                     ->get()
                     ->getResultArray(); // Get results as an array

SELECT *
FROM `users`
WHERE `id` = '5'
UPDATE `users` SET `account_status` = 'restricted'
WHERE `id` = '5'
---
    public function restrict($id) {
        helper(['form']); // Load form helper for form validation
        // Check if the request method is POST
        if($this->request->is('post')) {
            // Check if the user is an admin
            if (session()->get('user_role') !== 'admin') {
                session()->setFlashdata('error', 'You are not authorized to delete users.'); // Set an error message for unauthorized access
                return redirect()->to(base_url('user-management')); // Redirect to user management
            }

            $account_status = [
                'account_status' => 'restricted',
            ];

            $db = \Config\Database::connect(); // Connect to the database
            $builder = $db->table('users'); // Get the users table

            // Check if user exists
            $user = $builder->where('id', $id)->get()->getRow(); // Fetch the user by ID

            if ($user) {
                $builder->where('id', $id)->update($account_status); // Delete the user

SELECT *
FROM `users`
WHERE `id` = '5'
UPDATE `users` SET `account_status` = 'granted'
WHERE `id` = '5'
---
    public function unrestrictUser($id) {
        helper(['form']);
        if($this->request->is('post')) {
            $update = [
                'account_status' => 'granted',
            ];
             $db = \Config\Database::connect(); // Connect to the database
             $builder = $db->table('users'); // Get the users table
             $user = $builder->where('id', $id)->get()->getRow(); // Fetch the user by ID
              $builder->where('id', $id)->update( $update); // Update the user data